import decimal

from django.shortcuts import render

DATA = {
    'omlet': {
        'яйца, шт': 2,
        'молоко, л': 0.1,
        'соль, ч.л.': 0.5,
    },
    'pasta': {
        'макароны, г': 0.3,
        'сыр, г': 0.05,
    },
    'buter': {
        'хлеб, ломтик': 1,
        'колбаса, ломтик': 1,
        'сыр, ломтик': 1,
        'помидор, ломтик': 1,
    },

}


def calculate_recipe(request, recipe_name):
    servings = request.GET.get('servings', 1)
    context = {}
    recipe = {}
    for ingredients, amount in DATA[recipe_name].items():
        recipe[ingredients] = float(amount) * float(servings)
    context['recipe_name'] = recipe_name
    context['recipe'] = recipe
    context['servings'] = servings
    print(context)
    return render(request, 'calculator/index.html', context)


# Напишите ваш обработчик. Используйте DATA как источник данных
# Результат - render(request, 'calculator/index.html', context)
# В качестве контекста должен быть передан словарь с рецептом:
# context = {
#   'recipe': {
#     'ингредиент1': количество1,
#     'ингредиент2': количество2,
#   }
# }
